---
type: IFrameworkElementCreator
namespace: Autodesk.Revit.UI
version: 2024
members: 1
tags: [revit-api, class]
---

# IFrameworkElementCreator

`Autodesk.Revit.UI.IFrameworkElementCreator` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateFrameworkElement | 2018 | `FrameworkElement CreateFrameworkElement ()` |